Autodesk.Revit.DB.UpdaterId.#ctor(Autodesk.Revit.DB.AddInId,System.Guid)
creates an instance of UpdaterId for given AddInId and a given GUID value
addInId:
Id of addin that registers an Updater
val:
a GUID identifying the Updater within addin
Throws Autodesk.Revit.Exceptions.ArgumentException:
addInId is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011